app/views/notes/_note.html.erb

INSERT INTO `notes` (`description`, `appointment_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Now its been quite good ', 231, 5, '2018-03-11 10:09:46', '2018-03-11 10:09:46')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 18  ORDER BY `users`.`id` ASC LIMIT 1
---
        <div style="width: 200px; word-wrap: break-word;"><%= note.description %><br></div>
        <h5>By:<%= "#{ note.user.first_name } on #{note.user.created_at.strftime("%B %d, %Y")}" %></h5>