app/views/notes/_note.html.haml

      %b By:
      = "#{ note.user.first_name } on #{note.updated_at.strftime("%B %d, %Y")}"
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 18  ORDER BY `users`.`id` ASC LIMIT 1