app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`patient_id` = 18
INSERT INTO `appointments` (`date`, `doctor_id`, `image`, `patient_id`, `slot_tag`, `created_at`, `updated_at`) VALUES ('2018-03-03', 6, 'page.png', 18, '10:00', '2018-02-24 11:15:58', '2018-02-24 11:15:58')
INSERT INTO `notes` (`description`, `user_id`, `appointment_id`, `created_at`, `updated_at`) VALUES ('Fever', 18, 219, '2018-02-19 05:36:37', '2018-02-19 05:36:37')
---
  def create
    @appointment = Appointment.new(appointments_params)
    @appointment.patient_id = current_user.id
    @appointment.notes.first.user_id = current_user.id
    @all_doctors = User.getalldoctors
    UpdateWorker.perform_async(current_user.id)
    if @appointment.save

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 202 LIMIT 1
---
  def edit
    @appointment = Appointment.find(params[:id])

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 210 LIMIT 1
UPDATE `appointments` SET `date` = '2018-03-24', `image` = 'fever.jpg', `updated_at` = '2018-03-19 09:43:33' WHERE `appointments`.`id` = 235
---
  def update
    @appointment = Appointment.find(params[:id])
    @appointment.status = get_current_status(@appointment.date)
    @all_doctors = User.getalldoctors
    if @appointment.update(appointments_params)

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 215 LIMIT 1
DELETE FROM `appointments` WHERE `appointments`.`id` = 215
---
  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 210 LIMIT 1
---
  def show
    @appointment = Appointment.find(params[:id])

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 229 LIMIT 1
UPDATE `appointments` SET `status` = 2, `updated_at` = '2018-03-12 06:48:55' WHERE `appointments`.`id` = 229
---
  def cancel_appointment
    @appointment = Appointment.find(params[:id])
    @appointment.status = Appointment.statuses[:cancelled]
    if @appointment.save