app/controllers/notes_controller.rb

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 231 LIMIT 1
INSERT INTO `notes` (`description`, `appointment_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Now its been quite good ', 231, 5, '2018-03-11 10:09:46', '2018-03-11 10:09:46')
---
  def create
    @appointment = Appointment.find(params[:appointment_id])
    @note = @appointment.notes.new(notes_params)
    @note.user_id = current_user.id
    if @note.save

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 239 LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 239 AND `notes`.`id` = 356 LIMIT 1
DELETE FROM `notes` WHERE `notes`.`id` = 356
---
  def destroy
    @appointment = Appointment.find(params[:appointment_id])
    @note = @appointment.notes.find(params[:id])
    @note.destroy

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 219 LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 219 AND `notes`.`id` = 327 LIMIT 1
---
  def edit
    @appointment = Appointment.find(params[:appointment_id])
    @note = @appointment.notes.find(params[:id])

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 235 LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 235 AND `notes`.`id` = 346 LIMIT 1
UPDATE `notes` SET `description` = 'Follow the prescribed medicine', `updated_at` = '2018-03-19 09:45:21' WHERE `notes`.`id` = 346
---
  def update
    @appointment = Appointment.find(params[:appointment_id])
    @note = @appointment.notes.find(params[:id])
    if @note.update(notes_params)