app/views/appointments/edit.html.haml

      %h4 Cause:
      = f.fields_for :notes, f.object.notes.first do |note_field|
---
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 233  ORDER BY `notes`.`id` ASC LIMIT 1