app/views/appointments/edit.html.erb

SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 210  ORDER BY `notes`.`id` ASC LIMIT 1
---

            <%= f.fields_for :notes, f.object.notes.first do |note_field| %>