app/controllers/users/omniauth_callbacks_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'saura.mandal1@gmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def facebook
    @user = User.from_omniauth(request.env["omniauth.auth"])
    user = User.find_by(email: @user.email)

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'saura.mandal1@gmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def twitter
    @user = User.from_omniauth(request.env["omniauth.auth"])
    user = User.find_by(email: @user.email)